app/controllers/concerns/authenticable.rb

    def current_user
      @current_user ||= User.find_by(auth_token: request.headers['Authorization'])
---
SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "aHw2ysysFxeanDwUn4FW"], ["LIMIT", 1]]